--- src/bot/profile.rs
+++ replace BotProfile::decide -> PlayerAction with Default::default()
@@ -163,17 +163,17 @@
     /// ```
     #[must_use]
     pub fn decide(
         &self,
         hand: &BasicPile,
         players: &[PlayerView],
         ask_log: &[AskEntry],
     ) -> PlayerAction {
-        self.strategy.decide(hand, players, ask_log)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns a set of four pre-named bot profiles: two using [`BasicStrategy`]
     /// and two using [`RandomStrategy`].
     ///
     /// The profiles are (in order):
     /// 1. `BotProfile::basic("Harriet")`
     /// 2. `BotProfile::basic("Bertram")`
