--- src/bot/profile.rs
+++ replace BotProfile::default_profiles -> Vec<Self> with vec![Default::default()]
@@ -189,22 +189,17 @@
     /// assert_eq!(profiles.len(), 4);
     /// assert_eq!(profiles[0].name, "Harriet");
     /// assert_eq!(profiles[1].name, "Bertram");
     /// assert_eq!(profiles[2].name, "Lucky");
     /// assert_eq!(profiles[3].name, "Chance");
     /// ```
     #[must_use]
     pub fn default_profiles() -> Vec<Self> {
-        vec![
-            Self::basic("Harriet"),
-            Self::basic("Bertram"),
-            Self::random("Lucky"),
-            Self::random("Chance"),
-        ]
+        vec![Default::default()] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Clone for BotProfile {
     /// Clones the profile, preserving both the name and the strategy type.
     ///
     /// Built-in strategies ([`BotProfile::random`] and [`BotProfile::basic`])
     /// are cloned with the same strategy.  Profiles created via
