--- src/bot/profile.rs
+++ replace BotProfile::basic -> Self with Default::default()
@@ -86,21 +86,17 @@
     /// ```
     /// use gfcore::bot::BotProfile;
     ///
     /// let profile = BotProfile::basic("Harriet");
     /// assert_eq!(profile.name, "Harriet");
     /// ```
     #[must_use]
     pub fn basic(name: impl Into<String>) -> Self {
-        Self {
-            name: name.into(),
-            strategy: Box::new(BasicStrategy),
-            kind: StrategyKind::Basic,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Creates a profile backed by a custom [`BotStrategy`] implementation.
     ///
     /// # Examples
     ///
     /// ```
     /// use cardpack::prelude::BasicPile;
