--- src/bot/strategy/basic.rs
+++ replace != with == in <impl BotStrategy for BasicStrategy>::decide
@@ -127,17 +127,17 @@
             .iter()
             .rev()
             .find(|entry| entry.asker != observer)
             .map_or_else(
                 || {
                     // Fall back: pick a random non-self player.
                     let mut rng = rand::rng();
                     let targets: Vec<usize> =
-                        (0..players.len()).filter(|&idx| idx != observer).collect();
+                        (0..players.len()).filter(|&idx| idx == /* ~ changed by cargo-mutants ~ */ observer).collect();
                     if targets.is_empty() {
                         (observer + 1) % players.len().max(2)
                     } else {
                         let pick = rng.random_range(0..targets.len());
                         targets[pick]
                     }
                 },
                 |entry| entry.asker,
