--- src/bot/strategy/basic.rs
+++ replace % with + in <impl BotStrategy for BasicStrategy>::decide
@@ -129,17 +129,17 @@
             .find(|entry| entry.asker != observer)
             .map_or_else(
                 || {
                     // Fall back: pick a random non-self player.
                     let mut rng = rand::rng();
                     let targets: Vec<usize> =
                         (0..players.len()).filter(|&idx| idx != observer).collect();
                     if targets.is_empty() {
-                        (observer + 1) % players.len().max(2)
+                        (observer + 1) + /* ~ changed by cargo-mutants ~ */ players.len().max(2)
                     } else {
                         let pick = rng.random_range(0..targets.len());
                         targets[pick]
                     }
                 },
                 |entry| entry.asker,
             );
 
