--- src/bot/strategy/basic.rs
+++ replace <impl BotStrategy for BasicStrategy>::decide -> PlayerAction with Default::default()
@@ -79,76 +79,17 @@
     fn decide(
         &self,
         hand: &BasicPile,
         players: &[PlayerView],
         ask_log: &[AskEntry],
     ) -> PlayerAction {
         // Precondition: hand must be non-empty. The game engine enforces this,
         // but guard defensively so external callers never trigger a panic.
-        if hand.is_empty() {
-            return PlayerAction::Draw;
-        }
-
-        // Identify the bot's own player index.
-        let observer = players
-            .iter()
-            .position(|player_view| player_view.hand.is_some())
-            .unwrap_or(0);
-
-        // --- Rank selection: highest count in hand, tie-broken by index desc ---
-        let rank = {
-            // Count occurrences of each unique rank.
-            let mut rank_counts: Vec<(cardpack::prelude::Pip, usize)> = {
-                let mut counts: std::collections::HashMap<cardpack::prelude::Pip, usize> =
-                    std::collections::HashMap::new();
-                for card in hand.v() {
-                    *counts.entry(card.rank).or_insert(0) += 1;
-                }
-                counts.into_iter().collect()
-            };
-
-            // Sort by count descending, then by rank index string descending for
-            // stable tie-breaking without needing a numeric weight.
-            rank_counts.sort_by(|(rank_a, count_a), (rank_b, count_b)| {
-                count_b
-                    .cmp(count_a)
-                    .then_with(|| rank_b.index.cmp(&rank_a.index))
-            });
-
-            // hand is non-empty (guarded above) so rank_counts is non-empty.
-            match rank_counts.first() {
-                Some((pip, _)) => *pip,
-                // Unreachable: rank_counts is non-empty when hand is non-empty.
-                None => return PlayerAction::Draw,
-            }
-        };
-
-        // --- Target selection: most recent other-player entry in ask log ---
-        let target = ask_log
-            .iter()
-            .rev()
-            .find(|entry| entry.asker != observer)
-            .map_or_else(
-                || {
-                    // Fall back: pick a random non-self player.
-                    let mut rng = rand::rng();
-                    let targets: Vec<usize> =
-                        (0..players.len()).filter(|&idx| idx != observer).collect();
-                    if targets.is_empty() {
-                        (observer + 1) % players.len().max(2)
-                    } else {
-                        let pick = rng.random_range(0..targets.len());
-                        targets[pick]
-                    }
-                },
-                |entry| entry.asker,
-            );
-
-        PlayerAction::Ask { target, rank }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use cardpack::prelude::FrenchBasicCard;
 
