--- src/bot/strategy/random.rs
+++ replace <impl BotStrategy for RandomStrategy>::decide -> PlayerAction with Default::default()
@@ -69,47 +69,17 @@
     fn decide(
         &self,
         hand: &BasicPile,
         players: &[PlayerView],
         _ask_log: &[AskEntry],
     ) -> PlayerAction {
         // Precondition: hand must be non-empty. The game engine enforces this,
         // but guard defensively so external callers never trigger a panic.
-        if hand.is_empty() {
-            return PlayerAction::Draw;
-        }
-
-        let mut rng = rand::rng();
-
-        // Identify the observer (the bot) — the one view that has `hand: Some`.
-        let observer = players
-            .iter()
-            .position(|player_view| player_view.hand.is_some())
-            .unwrap_or(0);
-
-        // Pick a random card from hand and use its rank.
-        // Safety: hand.v() is non-empty (guarded above) and the index is < len.
-        let cards = hand.v();
-        let card_index = rng.random_range(0..cards.len());
-        #[allow(clippy::indexing_slicing)]
-        let rank = cards[card_index].rank;
-
-        // Build a list of valid (non-self) target indices.
-        let targets: Vec<usize> = (0..players.len()).filter(|&idx| idx != observer).collect();
-
-        let target = if targets.is_empty() {
-            // Degenerate case: only one player (should not happen in a real game).
-            (observer + 1) % players.len().max(2)
-        } else {
-            let pick = rng.random_range(0..targets.len());
-            targets[pick]
-        };
-
-        PlayerAction::Ask { target, rank }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use cardpack::prelude::FrenchBasicCard;
 
