--- src/bot/strategy/random.rs
+++ replace != with == in <impl BotStrategy for RandomStrategy>::decide
@@ -89,17 +89,17 @@
         // Pick a random card from hand and use its rank.
         // Safety: hand.v() is non-empty (guarded above) and the index is < len.
         let cards = hand.v();
         let card_index = rng.random_range(0..cards.len());
         #[allow(clippy::indexing_slicing)]
         let rank = cards[card_index].rank;
 
         // Build a list of valid (non-self) target indices.
-        let targets: Vec<usize> = (0..players.len()).filter(|&idx| idx != observer).collect();
+        let targets: Vec<usize> = (0..players.len()).filter(|&idx| idx == /* ~ changed by cargo-mutants ~ */ observer).collect();
 
         let target = if targets.is_empty() {
             // Degenerate case: only one player (should not happen in a real game).
             (observer + 1) % players.len().max(2)
         } else {
             let pick = rng.random_range(0..targets.len());
             targets[pick]
         };
