--- src/error/mod.rs
+++ replace <impl fmt::Display for GfError>::fmt -> fmt::Result with Ok(Default::default())
@@ -146,32 +146,17 @@
     ///     "parse error: unexpected token at line 3",
     /// );
     /// ```
     ParseError(String),
 }
 
 impl fmt::Display for GfError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::InvalidAsk => f.write_str("asker does not hold any card of the requested rank"),
-            Self::InvalidTarget => {
-                f.write_str("invalid target: player targeted themselves or index is out of range")
-            }
-            Self::OutOfTurn => f.write_str("action called when it is not this player's turn"),
-            Self::NotEnoughPlayers => {
-                f.write_str("game started with fewer players than the variant minimum")
-            }
-            Self::TooManyPlayers => {
-                f.write_str("game started with more players than the variant maximum")
-            }
-            Self::GameAlreadyOver => f.write_str("action called after the game has already ended"),
-            Self::EmptyDrawPile => f.write_str("draw attempted on an empty draw pile"),
-            Self::ParseError(msg) => write!(f, "parse error: {msg}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for GfError {}
 
 /// Convert a [`serde_json::Error`] into a [`GfError::ParseError`].
 ///
 /// This allows using `?` when deserializing JSON game history.
