--- src/error/mod.rs
+++ replace <impl From<serde_json::Error> for GfError>::from -> Self with Default::default()
@@ -182,17 +182,17 @@
 /// use gfcore::prelude::GfError;
 ///
 /// let json_err: Result<serde_json::Value, _> = serde_json::from_str("{bad json");
 /// let gf_err = GfError::from(json_err.unwrap_err());
 /// assert!(matches!(gf_err, GfError::ParseError(_)));
 /// ```
 impl From<serde_json::Error> for GfError {
     fn from(err: serde_json::Error) -> Self {
-        Self::ParseError(err.to_string())
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Convert a [`serde_norway::Error`] into a [`GfError::ParseError`].
 ///
 /// This allows using `?` when deserializing YAML game history (requires the
 /// `history` feature).
 ///
