--- src/error/mod.rs
+++ replace <impl From<serde_norway::Error> for GfError>::from -> Self with Default::default()
@@ -206,17 +206,17 @@
 ///
 /// let yaml_err: Result<serde_norway::Value, _> = serde_norway::from_str(":\n  bad: [yaml");
 /// let gf_err = GfError::from(yaml_err.unwrap_err());
 /// assert!(matches!(gf_err, GfError::ParseError(_)));
 /// ```
 #[cfg(feature = "history")]
 impl From<serde_norway::Error> for GfError {
     fn from(err: serde_norway::Error) -> Self {
-        Self::ParseError(err.to_string())
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
