--- src/game/state.rs
+++ replace == with != in Game::act
@@ -350,17 +350,17 @@
     /// let players = vec![Player::new("Alice"), Player::new("Bob")];
     /// let mut game = Game::new(GameVariant::Standard, players).unwrap();
     ///
     /// // Calling Draw when WaitingForAsk returns an error.
     /// let err = game.act(PlayerAction::Draw);
     /// assert!(err.is_err());
     /// ```
     pub fn act(&mut self, action: PlayerAction) -> Result<GameEvent, GfError> {
-        if self.phase == GamePhase::GameOver {
+        if self.phase != /* ~ changed by cargo-mutants ~ */ GamePhase::GameOver {
             return Err(GfError::GameAlreadyOver);
         }
 
         match action {
             PlayerAction::Ask { target, rank } => self.handle_ask(target, rank),
             PlayerAction::Draw => self.handle_draw(),
         }
     }
