--- src/game/state.rs
+++ replace Game::act -> Result<GameEvent, GfError> with Ok(Default::default())
@@ -350,24 +350,17 @@
     /// let players = vec![Player::new("Alice"), Player::new("Bob")];
     /// let mut game = Game::new(GameVariant::Standard, players).unwrap();
     ///
     /// // Calling Draw when WaitingForAsk returns an error.
     /// let err = game.act(PlayerAction::Draw);
     /// assert!(err.is_err());
     /// ```
     pub fn act(&mut self, action: PlayerAction) -> Result<GameEvent, GfError> {
-        if self.phase == GamePhase::GameOver {
-            return Err(GfError::GameAlreadyOver);
-        }
-
-        match action {
-            PlayerAction::Ask { target, rank } => self.handle_ask(target, rank),
-            PlayerAction::Draw => self.handle_draw(),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns a serialisable snapshot of the current game state.
     ///
     /// The player views are built from the perspective of the current player:
     /// they see their own full hand; all other players' hands are hidden.
     ///
     /// # Errors
