--- src/game/state.rs
+++ replace Game::state -> Result<GameState, GfError> with Ok(Default::default())
@@ -384,27 +384,17 @@
     /// let players = vec![Player::new("Alice"), Player::new("Bob")];
     /// let game = Game::new(GameVariant::Standard, players).unwrap();
     /// let state = game.state().unwrap();
     /// assert_eq!(state.phase, GamePhase::WaitingForAsk);
     /// assert_eq!(state.current_player, 0);
     /// assert_eq!(state.players.len(), 2);
     /// ```
     pub fn state(&self) -> Result<GameState, GfError> {
-        let players = PlayerView::from_perspective(&self.players, self.current_player)?;
-
-        Ok(GameState {
-            phase: self.phase.clone(),
-            current_player: self.current_player,
-            players,
-            draw_pile_size: self.draw_pile.len(),
-            last_event: self.last_event.clone(),
-            winner: self.winner,
-            ask_log: self.ask_log.clone(),
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the index of the player whose turn it is.
     ///
     /// # Examples
     ///
     /// ```
     /// use gfcore::prelude::{Game, GameVariant, Player};
