--- src/game/state.rs
+++ replace == with != in Game::is_over
@@ -442,17 +442,17 @@
     /// use gfcore::prelude::{Game, GameVariant, Player};
     ///
     /// let players = vec![Player::new("Alice"), Player::new("Bob")];
     /// let game = Game::new(GameVariant::Standard, players).unwrap();
     /// assert!(!game.is_over());
     /// ```
     #[must_use]
     pub fn is_over(&self) -> bool {
-        self.phase == GamePhase::GameOver
+        self.phase != /* ~ changed by cargo-mutants ~ */ GamePhase::GameOver
     }
 
     /// Returns a snapshot of the game history accumulated so far.
     ///
     /// The record grows automatically as [`Game::act`] is called.  Call this
     /// after [`Game::is_over`] returns `true` to get the complete record.
     ///
     /// # Examples
