--- src/game/state.rs
+++ replace Game::record -> GameRecord with Default::default()
@@ -464,26 +464,17 @@
     /// let game = Game::new(GameVariant::Standard, players).unwrap();
     /// let record = game.record();
     /// assert_eq!(record.variant, "Standard Go Fish");
     /// assert_eq!(record.players, vec!["Alice", "Bob"]);
     /// assert!(record.turns.is_empty());
     /// ```
     #[cfg(feature = "history")]
     pub fn record(&self) -> GameRecord {
-        let mut record = self.history.clone();
-        if !self.pending_turn_events.is_empty() {
-            let books: Vec<usize> = self.players.iter().map(Player::book_count).collect();
-            record.turns.push(TurnRecord {
-                player: self.pending_turn_player,
-                events: self.pending_turn_events.clone(),
-                books_after_turn: books,
-            });
-        }
-        record
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     // -----------------------------------------------------------------------
     // Private helpers — action handlers
     // -----------------------------------------------------------------------
 
     /// Handles a `PlayerAction::Ask`.
     fn handle_ask(&mut self, target: usize, rank: Pip) -> Result<GameEvent, GfError> {
