--- src/game/state.rs
+++ delete ! in Game::handle_ask
@@ -494,17 +494,17 @@
         let cp = self.current_player;
 
         // Validate target.
         if target == cp || target >= self.players.len() {
             return Err(GfError::InvalidTarget);
         }
 
         // The asker must hold the requested rank.
-        if !self.players[cp].has_rank(&rank) {
+        if  /* ~ changed by cargo-mutants ~ */self.players[cp].has_rank(&rank) {
             return Err(GfError::InvalidAsk);
         }
 
         // Record the ask in the public log before branching on Go-Fish/give.
         self.ask_log.push(AskEntry {
             asker: cp,
             rank: rank.index.to_string(),
         });
