--- src/game/state.rs
+++ delete match arm GameEvent::Book{..} in Game::handle_ask
@@ -562,17 +562,17 @@
             book_event
         } else {
             gave_event
         };
 
         // Transition to BookCompleted if a book was just made; otherwise stay
         // on WaitingForAsk (same player keeps turn in both cases).
         self.phase = match &last_event {
-            GameEvent::Book { .. } => GamePhase::BookCompleted,
+             /* ~ changed by cargo-mutants ~ */
             _ => GamePhase::WaitingForAsk,
         };
 
         // If the current player's hand is now empty (all cards went into
         // a book), they cannot ask again — replenish or skip them.
         self.ensure_current_player_can_ask();
 
         // Win-condition check (may overwrite phase to GameOver).
