--- src/game/state.rs
+++ replace != with == in Game::handle_draw
@@ -580,17 +580,17 @@
             return Ok(over_event);
         }
 
         Ok(last_event)
     }
 
     /// Handles a `PlayerAction::Draw`.
     fn handle_draw(&mut self) -> Result<GameEvent, GfError> {
-        if self.phase != GamePhase::WaitingForDraw {
+        if self.phase == /* ~ changed by cargo-mutants ~ */ GamePhase::WaitingForDraw {
             return Err(GfError::OutOfTurn);
         }
 
         // Save and clear last_asked_rank atomically so early-exit paths never
         // leave a stale value while the match check below still uses it.
         let asked_rank = self.last_asked_rank.take();
 
         let cp = self.current_player;
