--- src/game/state.rs
+++ replace Game::replenish_until_has_cards -> bool with false
@@ -694,38 +694,17 @@
     // -----------------------------------------------------------------------
 
     /// Replenishes `player_index`'s hand by drawing cards from the pile until
     /// they have at least one card that is NOT immediately turned into a book,
     /// or the draw pile runs out.
     ///
     /// Returns `true` if the player ends up with at least one card in hand.
     fn replenish_until_has_cards(&mut self, player_index: usize) -> bool {
-        if player_index >= self.players.len() {
-            return false;
-        }
-        let book_size = self.variant.rules().book_size();
-        // Draw cards until the player holds at least one or pile is exhausted.
-        // Bound the loop to the pile size to prevent any infinite loop.
-        let max_draws = self.draw_pile.len() + 1;
-        for _ in 0..max_draws {
-            if !self.players[player_index].hand_is_empty() {
-                return true;
-            }
-            if self.draw_pile.is_empty() {
-                return false;
-            }
-            if let Some(card) = self.draw_pile.draw_first() {
-                let r = card.rank;
-                self.players[player_index].receive_card(card);
-                // If the drawn card completes a book, it is removed from the hand.
-                self.check_and_collect_book(player_index, &r, book_size);
-            }
-        }
-        !self.players[player_index].hand_is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Advances `current_player` to the next player who can act.
     ///
     /// A player can act if they have cards in hand.  If their hand is empty
     /// and the draw pile is not empty, cards are dealt to them until they hold
     /// at least one non-book card.  Players whose hands remain empty after
     /// exhausting the pile are skipped.
