--- src/game/state.rs
+++ replace + with - in Game::replenish_until_has_cards
@@ -700,17 +700,17 @@
     /// Returns `true` if the player ends up with at least one card in hand.
     fn replenish_until_has_cards(&mut self, player_index: usize) -> bool {
         if player_index >= self.players.len() {
             return false;
         }
         let book_size = self.variant.rules().book_size();
         // Draw cards until the player holds at least one or pile is exhausted.
         // Bound the loop to the pile size to prevent any infinite loop.
-        let max_draws = self.draw_pile.len() + 1;
+        let max_draws = self.draw_pile.len() - /* ~ changed by cargo-mutants ~ */ 1;
         for _ in 0..max_draws {
             if !self.players[player_index].hand_is_empty() {
                 return true;
             }
             if self.draw_pile.is_empty() {
                 return false;
             }
             if let Some(card) = self.draw_pile.draw_first() {
