--- src/game/state.rs
+++ delete ! in Game::replenish_until_has_cards
@@ -715,17 +715,17 @@
             }
             if let Some(card) = self.draw_pile.draw_first() {
                 let r = card.rank;
                 self.players[player_index].receive_card(card);
                 // If the drawn card completes a book, it is removed from the hand.
                 self.check_and_collect_book(player_index, &r, book_size);
             }
         }
-        !self.players[player_index].hand_is_empty()
+         /* ~ changed by cargo-mutants ~ */self.players[player_index].hand_is_empty()
     }
 
     /// Advances `current_player` to the next player who can act.
     ///
     /// A player can act if they have cards in hand.  If their hand is empty
     /// and the draw pile is not empty, cards are dealt to them until they hold
     /// at least one non-book card.  Players whose hands remain empty after
     /// exhausting the pile are skipped.
