--- src/game/state.rs
+++ replace Game::advance_turn with ()
@@ -730,58 +730,17 @@
     /// at least one non-book card.  Players whose hands remain empty after
     /// exhausting the pile are skipped.
     ///
     /// If every player is unable to act and the pile is empty,
     /// `current_player` is still advanced (the win-condition check that
     /// follows will transition to `GameOver`).
     fn advance_turn(&mut self) {
         // Flush the outgoing player's turn before changing current_player.
-        #[cfg(feature = "history")]
-        self.flush_turn();
-
-        let count = self.players.len();
-        if count == 0 {
-            return;
-        }
-
-        let start = self.current_player;
-        let mut next = (start + 1) % count;
-
-        for _ in 0..count {
-            // If this player has cards they can act.
-            if !self.players[next].hand_is_empty() {
-                self.current_player = next;
-                #[cfg(feature = "history")]
-                {
-                    self.pending_turn_player = next;
-                }
-                return;
-            }
-            // Try to replenish from the pile.
-            if self.replenish_until_has_cards(next) {
-                self.current_player = next;
-                #[cfg(feature = "history")]
-                {
-                    self.pending_turn_player = next;
-                }
-                return;
-            }
-            // This player is out and so is the pile — skip them.
-            next = (next + 1) % count;
-        }
-
-        // Everyone is out and the pile is empty.  Set current_player to the
-        // slot after the one that just acted; check_win_condition will end
-        // the game momentarily.
-        self.current_player = next;
-        #[cfg(feature = "history")]
-        {
-            self.pending_turn_player = next;
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Ensures that `current_player` has cards to act with while phase is
     /// `WaitingForAsk`.  If their hand became empty (e.g., after completing a
     /// book that used all remaining cards) and the pile is also empty, the
     /// engine advances the turn.  If the pile is not empty it replenishes
     /// their hand.
     ///
