--- src/game/state.rs
+++ delete ! in Game::advance_turn
@@ -743,17 +743,17 @@
             return;
         }
 
         let start = self.current_player;
         let mut next = (start + 1) % count;
 
         for _ in 0..count {
             // If this player has cards they can act.
-            if !self.players[next].hand_is_empty() {
+            if  /* ~ changed by cargo-mutants ~ */self.players[next].hand_is_empty() {
                 self.current_player = next;
                 #[cfg(feature = "history")]
                 {
                     self.pending_turn_player = next;
                 }
                 return;
             }
             // Try to replenish from the pile.
