--- src/game/state.rs
+++ replace % with + in Game::advance_turn
@@ -761,17 +761,17 @@
                 self.current_player = next;
                 #[cfg(feature = "history")]
                 {
                     self.pending_turn_player = next;
                 }
                 return;
             }
             // This player is out and so is the pile — skip them.
-            next = (next + 1) % count;
+            next = (next + 1) + /* ~ changed by cargo-mutants ~ */ count;
         }
 
         // Everyone is out and the pile is empty.  Set current_player to the
         // slot after the one that just acted; check_win_condition will end
         // the game momentarily.
         self.current_player = next;
         #[cfg(feature = "history")]
         {
