--- src/game/state.rs
+++ replace Game::push_event with ()
@@ -804,17 +804,17 @@
 
     // -----------------------------------------------------------------------
     // Private helpers — history recording
     // -----------------------------------------------------------------------
 
     /// Appends `event` to the pending turn's event list.
     #[cfg(feature = "history")]
     fn push_event(&mut self, event: &GameEvent) {
-        self.pending_turn_events.push(event.clone());
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Flushes the pending turn into `history` and resets the accumulator.
     ///
     /// No-op if no events have been accumulated since the last flush, so it is
     /// safe to call unconditionally at the start of every `advance_turn()`.
     #[cfg(feature = "history")]
     fn flush_turn(&mut self) {
