--- src/game/state.rs
+++ replace Game::flush_turn with ()
@@ -813,25 +813,17 @@
     }
 
     /// Flushes the pending turn into `history` and resets the accumulator.
     ///
     /// No-op if no events have been accumulated since the last flush, so it is
     /// safe to call unconditionally at the start of every `advance_turn()`.
     #[cfg(feature = "history")]
     fn flush_turn(&mut self) {
-        if self.pending_turn_events.is_empty() {
-            return;
-        }
-        let books: Vec<usize> = self.players.iter().map(Player::book_count).collect();
-        self.history.turns.push(TurnRecord {
-            player: self.pending_turn_player,
-            events: std::mem::take(&mut self.pending_turn_events),
-            books_after_turn: books,
-        });
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     // -----------------------------------------------------------------------
     // Private helpers — book collection
     // -----------------------------------------------------------------------
 
     /// Checks whether `player` now has `book_size` cards of `rank` and, if so,
     /// removes them from the hand and records a book.  Returns `true` if a book
