--- src/game/state.rs
+++ replace Game::check_and_collect_book -> bool with false
@@ -832,26 +832,17 @@
     // -----------------------------------------------------------------------
     // Private helpers — book collection
     // -----------------------------------------------------------------------
 
     /// Checks whether `player` now has `book_size` cards of `rank` and, if so,
     /// removes them from the hand and records a book.  Returns `true` if a book
     /// was collected.
     fn check_and_collect_book(&mut self, player: usize, rank: &Pip, book_size: usize) -> bool {
-        if player >= self.players.len() {
-            return false;
-        }
-        let cards_of_rank = self.players[player].cards_of_rank(rank);
-        if cards_of_rank.len() >= book_size {
-            let book = self.players[player].give_cards_of_rank(rank);
-            self.players[player].add_book(book);
-            return true;
-        }
-        false
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Drains all completed books from `player`'s hand on game start.
     fn collect_books_for_player(player: &mut Player, book_size: usize) {
         let ranks: Vec<Pip> = player.held_ranks();
         for rank in ranks {
             let count = player.cards_of_rank(&rank).len();
             if count >= book_size {
