--- src/game/state.rs
+++ delete ! in Game::check_win_condition
@@ -897,17 +897,17 @@
     /// to [`GamePhase::GameOver`].  Returns the `GameOver` event if the game
     /// just ended, or `None` if play should continue.
     ///
     /// Game over when the draw pile is empty **and** one of the following:
     /// - Every player has an empty hand (all books are formed), OR
     /// - No productive ask is possible: no rank held by any player is also
     ///   held by a different player, making further book formation impossible.
     fn check_win_condition(&mut self) -> Option<GameEvent> {
-        if !self.draw_pile.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */self.draw_pile.is_empty() {
             return None;
         }
 
         // Primary condition: all hands empty.
         let all_hands_empty = self.players.iter().all(Player::hand_is_empty);
 
         // Secondary condition: no productive ask is possible anywhere.
         // Checked only when the pile is empty (expensive for large player counts).
