--- src/game/state.rs
+++ replace == with != in Game::check_win_condition
@@ -923,17 +923,17 @@
             .iter()
             .map(Player::book_count)
             .max()
             .unwrap_or(0);
         let winners: Vec<usize> = self
             .players
             .iter()
             .enumerate()
-            .filter(|(_, p)| p.book_count() == max_books)
+            .filter(|(_, p)| p.book_count() != /* ~ changed by cargo-mutants ~ */ max_books)
             .map(|(i, _)| i)
             .collect();
 
         let winner = if winners.len() == 1 {
             winners.first().copied()
         } else {
             None
         };
