--- src/history/record.rs
+++ replace GameRecord::from_yaml -> Result<Self, GfError> with Ok(Default::default())
@@ -151,17 +151,17 @@
     /// use gfcore::history::GameRecord;
     ///
     /// let record = GameRecord::new("Standard", vec!["Alice".to_string(), "Bob".to_string()]);
     /// let yaml = record.to_yaml().expect("serialize");
     /// let parsed = GameRecord::from_yaml(&yaml).expect("deserialize");
     /// assert_eq!(record, parsed);
     /// ```
     pub fn from_yaml(s: &str) -> Result<Self, GfError> {
-        serde_norway::from_str(s).map_err(GfError::from)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Serializes this record to a JSON string.
     ///
     /// # Errors
     ///
     /// Returns [`GfError::ParseError`] if serialization fails.
     ///
