--- src/history/record.rs
+++ replace GameRecord::from_json -> Result<Self, GfError> with Ok(Default::default())
@@ -192,17 +192,17 @@
     /// use gfcore::history::GameRecord;
     ///
     /// let record = GameRecord::new("Standard", vec!["Alice".to_string(), "Bob".to_string()]);
     /// let json = record.to_json().expect("serialize");
     /// let parsed = GameRecord::from_json(&json).expect("deserialize");
     /// assert_eq!(record, parsed);
     /// ```
     pub fn from_json(s: &str) -> Result<Self, GfError> {
-        serde_json::from_str(s).map_err(GfError::from)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ---------------------------------------------------------------------------
 // GameCollection
 // ---------------------------------------------------------------------------
 
 /// An ordered collection of [`GameRecord`]s.
