--- src/history/record.rs
+++ replace GameCollection::push with ()
@@ -245,17 +245,17 @@
     /// ```
     /// use gfcore::history::{GameCollection, GameRecord};
     ///
     /// let mut col = GameCollection::new();
     /// col.push(GameRecord::new("Standard", vec!["Alice".to_string()]));
     /// assert_eq!(col.len(), 1);
     /// ```
     pub fn push(&mut self, record: GameRecord) {
-        self.0.push(record);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the number of records in the collection.
     ///
     /// # Examples
     ///
     /// ```
     /// use gfcore::history::GameCollection;
