--- src/history/record.rs
+++ replace GameCollection::iter -> impl Iterator<Item =&GameRecord> with ::std::iter::empty()
@@ -290,17 +290,17 @@
     /// ```
     /// use gfcore::history::{GameCollection, GameRecord};
     ///
     /// let mut col = GameCollection::new();
     /// col.push(GameRecord::new("Standard", vec!["Alice".to_string()]));
     /// assert_eq!(col.iter().count(), 1);
     /// ```
     pub fn iter(&self) -> impl Iterator<Item = &GameRecord> {
-        self.0.iter()
+        ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Serializes this collection to a YAML string.
     ///
     /// # Errors
     ///
     /// Returns [`GfError::ParseError`] if serialization fails.
     ///
