--- src/history/record.rs
+++ replace GameCollection::to_json -> Result<String, GfError> with Ok(String::new())
@@ -352,17 +352,17 @@
     /// use gfcore::history::{GameCollection, GameRecord};
     ///
     /// let mut col = GameCollection::new();
     /// col.push(GameRecord::new("Standard", vec!["Alice".to_string()]));
     /// let json = col.to_json().expect("serialize");
     /// assert!(!json.is_empty());
     /// ```
     pub fn to_json(&self) -> Result<String, GfError> {
-        serde_json::to_string(self).map_err(GfError::from)
+        Ok(String::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Deserializes a [`GameCollection`] from a JSON string.
     ///
     /// # Errors
     ///
     /// Returns [`GfError::ParseError`] if the input is not valid JSON or does
     /// not match the expected structure.
