--- src/history/record.rs
+++ replace <impl std::ops::Index<usize> for GameCollection>::index -> &Self::Output with Box::leak(Box::new(Default::default()))
@@ -382,17 +382,17 @@
         serde_json::from_str(s).map_err(GfError::from)
     }
 }
 
 impl std::ops::Index<usize> for GameCollection {
     type Output = GameRecord;
 
     fn index(&self, idx: usize) -> &Self::Output {
-        &self.0[idx]
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ---------------------------------------------------------------------------
 // Unit tests
 // ---------------------------------------------------------------------------
 
 #[cfg(test)]
