--- src/player/player.rs
+++ replace == with != in Player::give_cards_of_rank
@@ -113,17 +113,17 @@
     /// let ace_rank = FrenchBasicCard::ACE_SPADES.rank;
     /// let given = player.give_cards_of_rank(&ace_rank);
     /// assert_eq!(given.len(), 2);
     /// assert_eq!(player.hand_size(), 1); // only King remains
     /// ```
     pub fn give_cards_of_rank(&mut self, rank: &Pip) -> BasicPile {
         let hand = std::mem::take(&mut self.hand);
         let (matching, remaining): (Vec<_>, Vec<_>) =
-            hand.into_iter().partition(|card| &card.rank == rank);
+            hand.into_iter().partition(|card| &card.rank != /* ~ changed by cargo-mutants ~ */ rank);
         self.hand = remaining.into_iter().collect();
         matching.into_iter().collect()
     }
 
     /// Returns `true` if the hand contains at least one card of the given rank.
     ///
     /// # Examples
     ///
