--- src/player/player.rs
+++ replace Player::has_rank -> bool with true
@@ -136,17 +136,17 @@
     ///
     /// let ace_rank = FrenchBasicCard::ACE_SPADES.rank;
     /// let king_rank = FrenchBasicCard::KING_SPADES.rank;
     /// assert!(player.has_rank(&ace_rank));
     /// assert!(!player.has_rank(&king_rank));
     /// ```
     #[must_use]
     pub fn has_rank(&self, rank: &Pip) -> bool {
-        self.hand.iter().any(|card| &card.rank == rank)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns a copy of all cards of the given rank without removing them.
     ///
     /// # Examples
     ///
     /// ```
     /// use cardpack::prelude::FrenchBasicCard;
