--- src/player/player.rs
+++ replace Player::cards_of_rank -> BasicPile with Default::default()
@@ -158,21 +158,17 @@
     ///
     /// let ace_rank = FrenchBasicCard::ACE_SPADES.rank;
     /// let peek = player.cards_of_rank(&ace_rank);
     /// assert_eq!(peek.len(), 2);
     /// assert_eq!(player.hand_size(), 2); // hand unchanged
     /// ```
     #[must_use]
     pub fn cards_of_rank(&self, rank: &Pip) -> BasicPile {
-        self.hand
-            .iter()
-            .filter(|card| &card.rank == rank)
-            .copied()
-            .collect()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Records a completed book, moving it from active play into the player's
     /// score pile.
     ///
     /// The caller is responsible for ensuring that `book` is a valid book
     /// according to the active [`crate::rules::GoFishRules`].
     ///
