--- src/player/player.rs
+++ replace Player::book_ranks -> Vec<String> with vec!["xyzzy".into()]
@@ -239,25 +239,17 @@
     ///     FrenchBasicCard::ACE_DIAMONDS,
     ///     FrenchBasicCard::ACE_CLUBS,
     /// ]);
     /// player.add_book(book);
     /// assert_eq!(player.book_ranks(), vec!["A".to_string()]);
     /// ```
     #[must_use]
     pub fn book_ranks(&self) -> Vec<String> {
-        self.books
-            .iter()
-            .map(|pile| {
-                debug_assert!(!pile.is_empty(), "book pile must not be empty");
-                pile.v()
-                    .first()
-                    .map_or_else(String::new, |card| card.rank.index.to_string())
-            })
-            .collect()
+        vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the number of cards currently in this player's hand.
     ///
     /// # Examples
     ///
     /// ```
     /// use cardpack::prelude::FrenchBasicCard;
