--- src/player/player.rs
+++ replace Player::held_ranks -> Vec<Pip> with vec![]
@@ -307,24 +307,17 @@
     /// player.receive_card(FrenchBasicCard::ACE_HEARTS);
     /// player.receive_card(FrenchBasicCard::KING_SPADES);
     ///
     /// let ranks = player.held_ranks();
     /// assert_eq!(ranks.len(), 2); // Ace and King — no duplicates
     /// ```
     #[must_use]
     pub fn held_ranks(&self) -> Vec<Pip> {
-        let mut seen = std::collections::HashSet::new();
-        let mut ranks = Vec::new();
-        for card in &self.hand {
-            if seen.insert(card.rank) {
-                ranks.push(card.rank);
-            }
-        }
-        ranks
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if this player is controlled by a bot.
     ///
     /// # Examples
     ///
     /// ```
     /// use gfcore::bot::BotProfile;
