--- src/player/player.rs
+++ replace Player::is_bot -> bool with true
@@ -333,17 +333,17 @@
     /// let human = Player::new("Leo");
     /// let bot = Player::new_bot("R2D2", BotProfile::random("R2D2"));
     ///
     /// assert!(!human.is_bot());
     /// assert!(bot.is_bot());
     /// ```
     #[must_use]
     pub fn is_bot(&self) -> bool {
-        self.profile.is_some()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns a read-only reference to the player's hand.
     ///
     /// # Examples
     ///
     /// ```
     /// use cardpack::prelude::FrenchBasicCard;
