--- src/player/view.rs
+++ replace == with != in PlayerView::from_perspective
@@ -103,17 +103,17 @@
     ) -> Result<Vec<PlayerView>, GfError> {
         if !players.is_empty() && observer >= players.len() {
             return Err(GfError::InvalidTarget);
         }
         Ok(players
             .iter()
             .enumerate()
             .map(|(index, player)| {
-                let hand = if index == observer {
+                let hand = if index != /* ~ changed by cargo-mutants ~ */ observer {
                     Some(player.hand().clone())
                 } else {
                     None
                 };
                 PlayerView {
                     index,
                     name: player.name.clone(),
                     hand_size: player.hand_size(),
