--- src/rules/happy_families.rs
+++ replace <impl DeckedBase for HappyFamilies>::base_vec -> Vec<BasicCard> with vec![Default::default()]
@@ -92,17 +92,17 @@
 }
 
 impl DeckedBase for HappyFamilies {
     fn colors() -> HashMap<Pip, Color> {
         Standard52::colors()
     }
 
     fn base_vec() -> Vec<BasicCard> {
-        Self::DECK.to_vec()
+        vec![Default::default()] /* ~ changed by cargo-mutants ~ */
     }
 
     fn deck_name() -> String {
         "Happy Families".to_string()
     }
 
     fn fluent_deck_key() -> String {
         cardpack::prelude::FLUENT_KEY_BASE_NAME_FRENCH.to_string()
