--- src/rules/happy_families.rs
+++ replace <impl DeckedBase for HappyFamilies>::deck_name -> String with String::new()
@@ -96,17 +96,17 @@
         Standard52::colors()
     }
 
     fn base_vec() -> Vec<BasicCard> {
         Self::DECK.to_vec()
     }
 
     fn deck_name() -> String {
-        "Happy Families".to_string()
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     fn fluent_deck_key() -> String {
         cardpack::prelude::FLUENT_KEY_BASE_NAME_FRENCH.to_string()
     }
 }
 
 // ---------------------------------------------------------------------------
