--- src/rules/happy_families.rs
+++ replace <impl GoFishRules for HappyFamiliesRules>::initial_hand_size -> usize with 0
@@ -189,17 +189,17 @@
     ///
     /// ```
     /// use gfcore::rules::{GoFishRules, HappyFamiliesRules};
     ///
     /// assert_eq!(HappyFamiliesRules.initial_hand_size(4), 6);
     /// assert_eq!(HappyFamiliesRules.initial_hand_size(5), 4);
     /// ```
     fn initial_hand_size(&self, player_count: usize) -> usize {
-        if player_count <= 4 { 6 } else { 4 }
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns 2: Happy Families requires at least 2 players.
     ///
     /// # Examples
     ///
     /// ```
     /// use gfcore::rules::{GoFishRules, HappyFamiliesRules};
