--- src/rules/happy_families.rs
+++ replace <impl GoFishRules for HappyFamiliesRules>::max_players -> usize with 0
@@ -215,17 +215,17 @@
     /// # Examples
     ///
     /// ```
     /// use gfcore::rules::{GoFishRules, HappyFamiliesRules};
     ///
     /// assert_eq!(HappyFamiliesRules.max_players(), 8);
     /// ```
     fn max_players(&self) -> usize {
-        8
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if `hand` contains at least one card of the requested rank.
     ///
     /// # Examples
     ///
     /// ```
     /// use cardpack::prelude::{BasicPile, FrenchBasicCard};
