--- src/rules/happy_families.rs
+++ replace <impl GoFishRules for HappyFamiliesRules>::is_valid_ask -> bool with true
@@ -235,17 +235,17 @@
     /// hand.push(FrenchBasicCard::ACE_SPADES);
     /// let rank = FrenchBasicCard::ACE_SPADES.rank;
     /// assert!(HappyFamiliesRules.is_valid_ask(&hand, &rank));
     ///
     /// let empty = BasicPile::default();
     /// assert!(!HappyFamiliesRules.is_valid_ask(&empty, &rank));
     /// ```
     fn is_valid_ask(&self, hand: &BasicPile, rank: &Pip) -> bool {
-        hand.iter().any(|card| &card.rank == rank)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if `cards` is a complete book: exactly 4 cards of the same rank.
     ///
     /// # Examples
     ///
     /// ```
     /// use cardpack::prelude::{BasicPile, FrenchBasicCard};
