--- src/rules/mod.rs
+++ replace <impl std::fmt::Debug for GameVariant>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -195,22 +195,17 @@
     /// Quartet variant — 32-card deck, 8 families.
     Quartet,
     /// A fully custom variant supplied by the caller.
     Custom(Box<dyn GoFishRules + Send + Sync>),
 }
 
 impl std::fmt::Debug for GameVariant {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        match self {
-            Self::Standard => write!(f, "GameVariant::Standard"),
-            Self::HappyFamilies => write!(f, "GameVariant::HappyFamilies"),
-            Self::Quartet => write!(f, "GameVariant::Quartet"),
-            Self::Custom(_) => write!(f, "GameVariant::Custom(<dyn GoFishRules>)"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl GameVariant {
     /// Returns a reference to the [`GoFishRules`] implementation for this
     /// variant.
     ///
     /// # Examples
