--- src/rules/mod.rs
+++ replace GameVariant::rules -> &dyn GoFishRules with Box::leak(Box::new(Default::default()))
@@ -222,22 +222,17 @@
     /// assert_eq!(rules.name(), "Standard Go Fish");
     /// assert_eq!(rules.book_size(), 4);
     ///
     /// assert_eq!(GameVariant::HappyFamilies.rules().book_size(), 4);
     /// assert_eq!(GameVariant::Quartet.rules().book_size(), 4);
     /// ```
     #[must_use]
     pub fn rules(&self) -> &dyn GoFishRules {
-        match self {
-            Self::Standard => &StandardRules,
-            Self::HappyFamilies => &HappyFamiliesRules,
-            Self::Quartet => &QuartetRules,
-            Self::Custom(rules) => rules.as_ref(),
-        }
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use cardpack::prelude::{BasicPile, FrenchBasicCard};
 
