--- src/rules/quartet.rs
+++ replace <impl GoFishRules for QuartetRules>::name -> &'static str with ""
@@ -132,17 +132,17 @@
     /// # Examples
     ///
     /// ```
     /// use gfcore::rules::{GoFishRules, QuartetRules};
     ///
     /// assert_eq!(QuartetRules.name(), "Quartet");
     /// ```
     fn name(&self) -> &'static str {
-        "Quartet"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns a freshly shuffled 32-card draw pile.
     ///
     /// # Examples
     ///
     /// ```
     /// use gfcore::rules::{GoFishRules, QuartetRules};
