--- src/rules/quartet.rs
+++ replace <impl GoFishRules for QuartetRules>::deck -> BasicPile with Default::default()
@@ -146,19 +146,17 @@
     ///
     /// ```
     /// use gfcore::rules::{GoFishRules, QuartetRules};
     ///
     /// let pile = QuartetRules.deck();
     /// assert_eq!(pile.len(), 32);
     /// ```
     fn deck(&self) -> BasicPile {
-        let mut pile = Quartet::basic_pile();
-        pile.shuffle();
-        pile
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns 4: four matching cards form a book.
     ///
     /// # Examples
     ///
     /// ```
     /// use gfcore::rules::{GoFishRules, QuartetRules};
