--- src/rules/quartet.rs
+++ replace <impl GoFishRules for QuartetRules>::initial_hand_size -> usize with 1
@@ -175,17 +175,17 @@
     ///
     /// ```
     /// use gfcore::rules::{GoFishRules, QuartetRules};
     ///
     /// assert_eq!(QuartetRules.initial_hand_size(4), 8);
     /// assert_eq!(QuartetRules.initial_hand_size(5), 6);
     /// ```
     fn initial_hand_size(&self, player_count: usize) -> usize {
-        if player_count <= 4 { 8 } else { 6 }
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns 2: Quartet requires at least 2 players.
     ///
     /// # Examples
     ///
     /// ```
     /// use gfcore::rules::{GoFishRules, QuartetRules};
