--- src/rules/quartet.rs
+++ replace == with != in <impl GoFishRules for QuartetRules>::is_valid_ask
@@ -221,17 +221,17 @@
     /// hand.push(FrenchBasicCard::ACE_SPADES);
     /// let rank = FrenchBasicCard::ACE_SPADES.rank;
     /// assert!(QuartetRules.is_valid_ask(&hand, &rank));
     ///
     /// let empty = BasicPile::default();
     /// assert!(!QuartetRules.is_valid_ask(&empty, &rank));
     /// ```
     fn is_valid_ask(&self, hand: &BasicPile, rank: &Pip) -> bool {
-        hand.iter().any(|card| &card.rank == rank)
+        hand.iter().any(|card| &card.rank != /* ~ changed by cargo-mutants ~ */ rank)
     }
 
     /// Returns `true` if `cards` is a complete book: exactly 4 cards of the same rank.
     ///
     /// # Examples
     ///
     /// ```
     /// use cardpack::prelude::{BasicPile, FrenchBasicCard};
