--- src/rules/quartet.rs
+++ replace <impl GoFishRules for QuartetRules>::is_book -> bool with false
@@ -248,22 +248,17 @@
     /// let not_book = BasicPile::from(vec![
     ///     FrenchBasicCard::ACE_SPADES,
     ///     FrenchBasicCard::ACE_HEARTS,
     ///     FrenchBasicCard::ACE_DIAMONDS,
     /// ]);
     /// assert!(!QuartetRules.is_book(&not_book));
     /// ```
     fn is_book(&self, cards: &BasicPile) -> bool {
-        if cards.len() != self.book_size() {
-            return false;
-        }
-        #[allow(clippy::indexing_slicing)]
-        let first_rank = cards.v()[0].rank;
-        cards.iter().all(|card| card.rank == first_rank)
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
