--- src/rules/quartet.rs
+++ replace <impl DeckedBase for Quartet>::colors -> HashMap<Pip, Color> with HashMap::new()
@@ -74,17 +74,17 @@
         FrenchBasicCard::NINE_CLUBS,
         FrenchBasicCard::EIGHT_CLUBS,
         FrenchBasicCard::SEVEN_CLUBS,
     ];
 }
 
 impl DeckedBase for Quartet {
     fn colors() -> HashMap<Pip, Color> {
-        Standard52::colors()
+        HashMap::new() /* ~ changed by cargo-mutants ~ */
     }
 
     fn base_vec() -> Vec<BasicCard> {
         Self::DECK.to_vec()
     }
 
     fn deck_name() -> String {
         "Quartet".to_string()
