--- src/rules/quartet.rs
+++ replace <impl DeckedBase for Quartet>::fluent_deck_key -> String with "xyzzy".into()
@@ -86,17 +86,17 @@
         Self::DECK.to_vec()
     }
 
     fn deck_name() -> String {
         "Quartet".to_string()
     }
 
     fn fluent_deck_key() -> String {
-        cardpack::prelude::FLUENT_KEY_BASE_NAME_FRENCH.to_string()
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ---------------------------------------------------------------------------
 // QuartetRules (GoFishRules implementation)
 // ---------------------------------------------------------------------------
 
 /// Go Fish rules for the Quartet variant.
