--- src/rules/standard.rs
+++ replace <impl GoFishRules for StandardRules>::is_valid_ask -> bool with false
@@ -126,17 +126,17 @@
     /// let ace_rank: Pip = pile.v()[0].rank;
     /// assert!(StandardRules.is_valid_ask(&pile, &ace_rank));
     ///
     /// // Build an empty hand and verify that any ask is invalid.
     /// let empty = BasicPile::default();
     /// assert!(!StandardRules.is_valid_ask(&empty, &ace_rank));
     /// ```
     fn is_valid_ask(&self, hand: &BasicPile, rank: &Pip) -> bool {
-        hand.iter().any(|card| &card.rank == rank)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if the pile constitutes a complete book.
     ///
     /// A book is exactly four cards that all share the same rank.
     ///
     /// # Examples
     ///
