--- src/rules/standard.rs
+++ replace == with != in <impl GoFishRules for StandardRules>::is_book
@@ -164,17 +164,17 @@
     /// ```
     fn is_book(&self, cards: &BasicPile) -> bool {
         if cards.len() != self.book_size() {
             return false;
         }
         // SAFETY: len == book_size() >= 1, so index 0 is valid
         #[allow(clippy::indexing_slicing)]
         let first_rank = cards.v()[0].rank;
-        cards.v().iter().all(|card| card.rank == first_rank)
+        cards.v().iter().all(|card| card.rank != /* ~ changed by cargo-mutants ~ */ first_rank)
     }
 }
 
 use super::GoFishRules;
 
 #[cfg(test)]
 mod tests {
     use super::*;
