--- src/wasm_api.rs
+++ replace > with < in new_bot_game
@@ -138,17 +138,17 @@
 #[wasm_bindgen]
 pub fn new_bot_game(variant: &str, bot_count: usize, _seed: f64) -> String {
     let game_variant = match parse_variant(variant) {
         Ok(v) => v,
         Err(e) => return error_json(&e),
     };
 
     let mut all_profiles = BotProfile::default_profiles();
-    if bot_count > all_profiles.len() {
+    if bot_count < /* ~ changed by cargo-mutants ~ */ all_profiles.len() {
         return error_json(&format!(
             "bot_count {bot_count} exceeds available default profiles ({})",
             all_profiles.len()
         ));
     }
     let bot_profiles: Vec<BotProfile> = all_profiles.drain(..bot_count).collect();
 
     let players: Vec<Player> = bot_profiles
