--- src/wasm_api.rs
+++ replace new_human_vs_bots_game -> String with "xyzzy".into()
@@ -193,60 +193,17 @@
 #[must_use]
 #[wasm_bindgen]
 pub fn new_human_vs_bots_game(
     variant: &str,
     human_name: &str,
     bot_count: usize,
     _seed: f64,
 ) -> String {
-    let game_variant = match parse_variant(variant) {
-        Ok(v) => v,
-        Err(e) => return error_json(&e),
-    };
-
-    if bot_count == 0 {
-        return error_json("bot_count must be at least 1");
-    }
-
-    let mut all_profiles = BotProfile::default_profiles();
-    if bot_count > all_profiles.len() {
-        return error_json(&format!(
-            "bot_count {bot_count} exceeds available default profiles ({})",
-            all_profiles.len()
-        ));
-    }
-    let bot_profiles: Vec<BotProfile> = all_profiles.drain(..bot_count).collect();
-
-    let mut players = vec![Player::new(human_name)];
-    let mut profiles: Vec<Option<BotProfile>> = vec![None];
-
-    for profile in bot_profiles {
-        players.push(Player::new_bot(profile.name.clone(), profile.clone()));
-        profiles.push(Some(profile));
-    }
-
-    let game = match Game::new(game_variant, players) {
-        Ok(g) => g,
-        Err(e) => return error_json(&e.to_string()),
-    };
-
-    let state_json = match game.state() {
-        Ok(s) => match serde_json::to_string(&s) {
-            Ok(j) => j,
-            Err(e) => return error_json(&e.to_string()),
-        },
-        Err(e) => return error_json(&e.to_string()),
-    };
-
-    GAME.with(|g| *g.borrow_mut() = Some(game));
-    PROFILES.with(|p| *p.borrow_mut() = profiles);
-    LAST_EVENT.with(|le| *le.borrow_mut() = None);
-
-    state_json
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Submits a player action and advances the game state.
 ///
 /// `action_json` must be one of:
 /// - `{"Ask":{"target":1,"rank":{"weight":12,"index":"A","value":0}}}` for an ask
 /// - `"Draw"` for a draw
 ///
