--- src/wasm_api.rs
+++ replace get_state -> String with String::new()
@@ -280,29 +280,17 @@
 }
 
 /// Returns the current [`crate::game::GameState`] as JSON.
 ///
 /// Returns `{"error": "no game in progress"}` if no game has been started.
 #[must_use]
 #[wasm_bindgen]
 pub fn get_state() -> String {
-    GAME.with(|cell| {
-        let borrow = cell.borrow();
-        match borrow.as_ref() {
-            None => error_json("no game in progress"),
-            Some(game) => match game.state() {
-                Ok(s) => match serde_json::to_string(&s) {
-                    Ok(j) => j,
-                    Err(e) => error_json(&e.to_string()),
-                },
-                Err(e) => error_json(&e.to_string()),
-            },
-        }
-    })
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// If the current player is a bot, computes and applies their action.
 ///
 /// Returns:
 /// - `{"done":false,"event":<GameEvent JSON>}` after the bot acted.
 /// - `{"done":true}` if it is not a bot's turn or the game is over.
 /// - `{"error":"..."}` on failure.
