--- src/wasm_api.rs
+++ replace == with != in step_bot
@@ -347,17 +347,17 @@
         None => return error_json("current_player index out of range"),
         Some(view) => match view.hand.clone() {
             None => return error_json("bot hand not visible in state"),
             Some(h) => h,
         },
     };
 
     // In WaitingForDraw the bot must draw, not ask.
-    let action = if state.phase == GamePhase::WaitingForDraw {
+    let action = if state.phase != /* ~ changed by cargo-mutants ~ */ GamePhase::WaitingForDraw {
         PlayerAction::Draw
     } else {
         profile.decide(&hand, &state.players, &state.ask_log)
     };
 
     // Apply the action.
     let event_json = GAME.with(|cell| {
         let mut borrow = cell.borrow_mut();
