--- src/wasm_api.rs
+++ replace wasm_init with ()
@@ -39,17 +39,17 @@
 // ---------------------------------------------------------------------------
 // Panic hook
 // ---------------------------------------------------------------------------
 
 /// Installs the `console_error_panic_hook` so that Rust panics appear in the
 /// browser console rather than being silently swallowed.
 #[wasm_bindgen(start)]
 pub fn wasm_init() {
-    console_error_panic_hook::set_once();
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 // ---------------------------------------------------------------------------
 // Private helpers
 // ---------------------------------------------------------------------------
 
 /// Formats a JSON error object from an error message string.
 fn error_json(msg: &str) -> String {
