--- src/wasm_api.rs
+++ replace parse_variant -> Result<GameVariant, String> with Ok(Default::default())
@@ -53,22 +53,17 @@
 
 /// Formats a JSON error object from an error message string.
 fn error_json(msg: &str) -> String {
     format!("{{\"error\":{}}}", serde_json::json!(msg))
 }
 
 /// Parses a variant name string into a [`GameVariant`].
 fn parse_variant(s: &str) -> Result<GameVariant, String> {
-    match s {
-        "Standard" => Ok(GameVariant::Standard),
-        "HappyFamilies" => Ok(GameVariant::HappyFamilies),
-        "Quartet" => Ok(GameVariant::Quartet),
-        _ => Err(format!("unknown variant: {s}")),
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 // ---------------------------------------------------------------------------
 // Exported functions
 // ---------------------------------------------------------------------------
 
 /// Returns the crate version string.
 ///
