--- src/wasm_api.rs
+++ delete match arm "Standard" in parse_variant
@@ -54,17 +54,17 @@
 /// Formats a JSON error object from an error message string.
 fn error_json(msg: &str) -> String {
     format!("{{\"error\":{}}}", serde_json::json!(msg))
 }
 
 /// Parses a variant name string into a [`GameVariant`].
 fn parse_variant(s: &str) -> Result<GameVariant, String> {
     match s {
-        "Standard" => Ok(GameVariant::Standard),
+         /* ~ changed by cargo-mutants ~ */
         "HappyFamilies" => Ok(GameVariant::HappyFamilies),
         "Quartet" => Ok(GameVariant::Quartet),
         _ => Err(format!("unknown variant: {s}")),
     }
 }
 
 // ---------------------------------------------------------------------------
 // Exported functions
