--- src/wasm_api.rs
+++ delete match arm "HappyFamilies" in parse_variant
@@ -55,17 +55,17 @@
 fn error_json(msg: &str) -> String {
     format!("{{\"error\":{}}}", serde_json::json!(msg))
 }
 
 /// Parses a variant name string into a [`GameVariant`].
 fn parse_variant(s: &str) -> Result<GameVariant, String> {
     match s {
         "Standard" => Ok(GameVariant::Standard),
-        "HappyFamilies" => Ok(GameVariant::HappyFamilies),
+         /* ~ changed by cargo-mutants ~ */
         "Quartet" => Ok(GameVariant::Quartet),
         _ => Err(format!("unknown variant: {s}")),
     }
 }
 
 // ---------------------------------------------------------------------------
 // Exported functions
 // ---------------------------------------------------------------------------
