--- src/wasm_api.rs
+++ replace version -> String with String::new()
@@ -75,17 +75,17 @@
 /// # Examples (JavaScript)
 ///
 /// ```javascript
 /// console.log(version()); // "0.1.0"
 /// ```
 #[must_use]
 #[wasm_bindgen]
 pub fn version() -> String {
-    env!("CARGO_PKG_VERSION").to_string()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Creates a new game with named human players.
 ///
 /// - `variant`: `"Standard"`, `"HappyFamilies"`, or `"Quartet"`.
 /// - `player_names_json`: JSON array of strings, e.g. `'["Alice","Bob"]'`.
 /// - `_seed`: reserved for future reproducible shuffle support; currently
 ///   the deck shuffle uses the system RNG and this value is ignored.
